---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureURepeat
source: html/10ecdb1e-bb0d-3be0-581c-be39ab4010a1.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureURepeat Property

The property labeled "U Repeat" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureURepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".